package com.javarush.task.task10.task1012;

import java.io.BufferedReader;
import java.io.InputStreamReader;
import java.util.ArrayList;

/**
 * Количество букв
 * Ввести с клавиатуры 10 строчек и подсчитать в них количество различных букв (для 33 маленьких букв алфавита)
 * . Результат вывести на экран в алфавитном порядке.
 *
 * Пример вывода:
 * а 5
 * б 8
 * в 3
 * г 7
 * д 0
 * ...
 * я 9
 *
 *
 * Требования:
 * 1. Программа должна 10 раз считывать данные с клавиатуры.
 * 2. Программа должна выводить текст на экран.
 * 3. Выведенный текст должен содержать 33 строки.
 * 4. Каждая строка вывода должна содержать букву русского алфавита, пробел и сколько раз
 * буква встречалась в введенных строках.
Количество букв
*/

public class Solution {
    public static void main(String[] args) throws Exception {
        int[] array = {5, 8, 1, 0, 4, 2, 12 , 12, 43, 6};
        int[] array2 = {15, 3, 0, 21, 4, 6, 9 , 12, 43, 6};
        }


        // напишите тут ваш код
    }

}
