package com.javarush.task.task05.task0517;

/**
 * Конструируем котиков
 * Создать класс Cat (кот) с пятью конструкторами:
 * - Имя,
 * - Имя, вес, возраст
 * - Имя, возраст (вес стандартный)
 * - вес, цвет, (имя, адрес и возраст - неизвестные. Кот - бездомный)
 * - вес, цвет, адрес (чужой домашний кот)
 * <p>
 * Задача конструктора - сделать объект валидным.
 * Например, если вес не известен, то нужно указать какой-нибудь средний вес.
 * Кот не может ничего не весить.
 * То же касательно возраста. А вот имени может и не быть (null). То же касается адреса: null.
 * <p>
 * <p>
 * Требования:
 * 1. У класса Cat должна быть переменная name с типом String.
 * 2. У класса Cat должна быть переменная age с типом int.
 * 3. У класса Cat должна быть переменная weight с типом int.
 * 4. У класса Cat должна быть переменная address с типом String.
 * 5. У класса Cat должна быть переменная color с типом String.
 * 6. У класса должен быть конструктор, принимающий в качестве параметра имя, но инициализирующий все переменные класса,
 * кроме адреса.
 * 7. У класса должен быть конструктор, принимающий в качестве параметров имя, вес, возраст и инициализирующий все
 * переменные класса, кроме адреса.
 * 8. У класса должен быть конструктор, принимающий в качестве параметров имя, возраст и инициализирующий все переменные
 * класса, кроме адреса.
 * 9. У класса должен быть конструктор, принимающий в качестве параметров вес, цвет и инициализирующий все переменные
 * класса, кроме имени и адреса.
 * 10. У класса должен быть конструктор, принимающий в качестве параметров вес, цвет, адрес и инициализирующий все
 * переменные класса, кроме имени.
 * Конструируем котиков
 */

public class Cat {
    //напишите тут ваш код
    String name = null;
    int age;
    int weight;
    String address = null;
    String color = "red";

    //У класса должен быть конструктор, принимающий в качестве параметра имя, но инициализирующий все переменные класса, кроме адреса.
    public Cat(String name) {
        this.name = name;
        weight = 10;
        age = 2;
        color = "black";
    }

    //принимающий в качестве параметров имя, вес, возраст и инициализирующий все переменные класса, кроме адреса.
    public Cat(String name, int weight, int age) {
        this.name = name;
        this.weight = weight;
        this.age = age;
        color = "white";
    }

    //принимающий в качестве параметров имя, возраст и инициализирующий все переменные класса, кроме адреса.
    public Cat(String name, int age) {
        this.name = name;
        this.age = age;
        weight = 5;
        color = "red";
    }

    // принимающий в качестве параметров вес, цвет и инициализирующий все переменные класса, кроме имени и адреса.
    public Cat(int weight, String color) {
        age = 100;
        this.weight = weight;
        this.color = color;
    }

    //принимающий в качестве параметров вес, цвет, адрес и инициализирующий все переменные класса, кроме имени.
    public Cat(int weight, String color, String address) {

        age = 1000;
        this.weight = weight;
        this.address = address;
        this.color = color;

    }
}